In [3]:
import pandas as pd

In [4]:
from pandas import Series, DataFrame

In [5]:
exampleList = ["Navina", "Prof Gerald", "CSE department"]
exampleSeries = Series(exampleList)
print(exampleList)

['Navina', 'Prof Gerald', 'CSE department']

In [6]:
print(exampleSeries)

0            Navina
1       Prof Gerald
2    CSE department
dtype: object

In [7]:
exampleSeries[0]

'Navina'

In [8]:
exampleSeries[1]

'Prof Gerald'

In [9]:
type_column = Series(["Student","Professor", "Professor", "Professor"])
name_column = Series(["Navina", "Gerald", "Alvarado", "Paul Cao"])
table = DataFrame({'Job':type_column, 'Name':name_column})
table

         Job      Name
0    Student    Navina
1  Professor    Gerald
2  Professor  Alvarado
3  Professor  Paul Cao

In [10]:
#retrieving just the name:
table["Name"]

0      Navina
1      Gerald
2    Alvarado
3    Paul Cao
Name: Name, dtype: object

In [11]:
#retrieving just the job:
table["Job"]

0      Student
1    Professor
2    Professor
3    Professor
Name: Job, dtype: object

In [12]:
pwd

'/Users/navina/Desktop/UCSD/Research/Jupyter Notebook programs'

In [13]:
sat_scores = pd.read_csv('/Users/navina/Desktop/UCSD/Research/Jupyter Notebook programs/SAT_results.csv')
sat_scores.head()

,DBN,School Name,Number of Test Takers,Critical Reading Mean,Mathematics Mean,Writing Mean
0,01M292,Henry Street School for International Studies,31.0,391.0,425.0,385.0
1,01M448,University Neighborhood High School,60.0,394.0,419.0,387.0
2,01M450,East Side Community High School,69.0,418.0,431.0,402.0
3,01M458,SATELLITE ACADEMY FORSYTH ST,26.0,385.0,370.0,378.0
4,01M509,CMSP HIGH SCHOOL,NaN,NaN,NaN,NaN

In [14]:
print("Number of schools in NYC that provided SAT data: ", len(sat_scores))

Number of schools in NYC that provided SAT data:  460

In [15]:
#pulling out just the number of test takers:
test_takers = sat_scores["Number of Test Takers"]
test_takers.head(100) #viewing the first 100 schools test takers

0      31.0
1      60.0
2      69.0
3      26.0
4       NaN
      ...
95     16.0
96    216.0
97     52.0
98     54.0
99    106.0
Name: Number of Test Takers, Length: 100, dtype: float64

In [16]:
test_takers.mean() #average number of test takers across schools in NYC

103.65803108808291

In [17]:
sat_scores.columns #prints the columns in the CSV file which was converted to a table

Index(['DBN', 'School Name', 'Number of Test Takers', 'Critical Reading Mean',
       'Mathematics Mean', 'Writing Mean'],
      dtype='object')